espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EZR32WG/Include/ezr32wg330f128r69.h
/** @} End of group EZR32WG330F128R69_Peripheral_Declaration */

/***************************************************************************//**
 * @defgroup EZR32WG330F128R69_BitFields EZR32WG330F128R69 Bit Fields
 * @{
 ******************************************************************************/

#include "ezr32wg_prs_signals.h"
#include "ezr32wg_dmareq.h"
#include "ezr32wg_dmactrl.h"
#include "ezr32wg_usartrf.h"
#include "ezr32wg_uart.h"

/***************************************************************************//**
 * @defgroup EZR32WG330F128R69_UNLOCK EZR32WG330F128R69 Unlock Codes
 * @{
 ******************************************************************************/
#define MSC_UNLOCK_CODE      0x1B71 /**< MSC unlock code */
#define EMU_UNLOCK_CODE      0xADE8 /**< EMU unlock code */
#define CMU_UNLOCK_CODE      0x580E /**< CMU unlock code */
#define TIMER_UNLOCK_CODE    0xCE80 /**< TIMER unlock code */
#define GPIO_UNLOCK_CODE     0xA534 /**< GPIO unlock code */
#define BURTC_UNLOCK_CODE    0xAEE8 /**< BURTC unlock code */

/** @} End of group EZR32WG330F128R69_UNLOCK */

/** @} End of group EZR32WG330F128R69_BitFields */

/***************************************************************************//**
 * @defgroup EZR32WG330F128R69_Alternate_Function EZR32WG330F128R69 Alternate Function
 * @{
 ******************************************************************************/

#include "ezr32wg_af_ports.h"
#include "ezr32wg_af_pins.h"

/** @} End of group EZR32WG330F128R69_Alternate_Function */

/***************************************************************************//**
 *  @brief Set the value of a bit field within a register.
 *
 *  @param REG
 *       The register to update
 *  @param MASK
 *       The mask for the bit field to update
 *  @param VALUE
 *       The value to write to the bit field
 *  @param OFFSET
 *       The number of bits that the field is offset within the register.
 *       0 (zero) means LSB.
 ******************************************************************************/
#define SET_BIT_FIELD(REG, MASK, VALUE, OFFSET) \
  REG = ((REG) &~(MASK)) | (((VALUE) << (OFFSET)) & (MASK));

/** @} End of group EZR32WG330F128R69 */

/** @} End of group Parts */

#ifdef __cplusplus
}
#endif

#endif /* EZR32WG330F128R69_H */
